page-view-converter/resources/pages/blog/clojure-write-file-to-resource-folder.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-02-05 Sat 21:31 -->
<meta charset="utf-8">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Gene Nakagaki">

<meta charset="UTF-8">
<meta name="description" content="Free Web tutorials">
</head>
<body>
<div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b3dcbf">1. How to write a new file to the resource folder in Clojure</a>
<ul>
<li><a href="#orga411194">1.1. TL;DR</a></li>
<li><a href="#org73c3c27">1.2. The problem I had</a></li>
<li><a href="#org685e229">1.3. The solution</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
#Date: 2021/2/3aa
</p>

<div id="outline-container-org9b3dcbf" class="outline-2">
<h2 id="org9b3dcbf"><span class="section-number-2">1</span> How to write a new file to the resource folder in Clojure</h2>
<div class="outline-text-2" id="text-1">
<p>
When I was working on one of my clojure projects, I wanted to write a new file to the resource folder. I got an error with the <code>spit</code> function and had to spend time figuring this out. I ended up not writing to the resource folder, but instead pass a file path as an argument. But for those who run in to the same problem, including me in the future, here it is.
</p>
</div>

<div id="outline-container-orga411194" class="outline-3">
<h3 id="orga411194"><span class="section-number-3">1.1</span> TL;DR</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Folder structure
</p>
<pre class="example" id="org49d0154">
.
├── README.md
├── deps.edn
├── src
├── └── core.clj
└── resources
    └── a-directory
</pre>

<p>
To write to <code>resources/a-directory/a-file.txt</code>, do this
</p>
<div class="org-src-container">
<pre class="src src-clojure">(require '[clojure.java.io :as io])

(let [folder-url (io/resource "a-directory")
      folder-path (.getPath folder-url)
      file-path (str folder-path "/a-file.txt")]
  (spit file-path "hello world!"))
</pre>
</div>
</div>
</div>

<div id="outline-container-org73c3c27" class="outline-3">
<h3 id="org73c3c27"><span class="section-number-3">1.2</span> The problem I had</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I was trying to write to a new file in the resource folder. My folder directory was kind of like this.
</p>
<pre class="example" id="org8bb73ee">
.
├── README.md
├── deps.edn
├── src
├── └── core.clj
└── resources
    └── a-directory
</pre>

<p>
I tried this code
</p>
<div class="org-src-container">
<pre class="src src-clojure">(spit (io/resource "a-directory/a-file.txt") "hello world!")
</pre>
</div>

<p>
But the REPL gave me this error
</p>
<div class="org-src-container">
<pre class="src src-clojure">; Execution error (IllegalArgumentException) at genenakagaki.page-view-converter/eval8279 (REPL:28).
; Cannot open &lt;nil&gt; as a Writer.
</pre>
</div>

<p>
This code worked with an already existing file, but was failing with a new file. The cause was <code>(io/resource "a-directory/a-file.txt")</code> returning a nil.
</p>
</div>
</div>

<div id="outline-container-org685e229" class="outline-3">
<h3 id="org685e229"><span class="section-number-3">1.3</span> The solution</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I ended up just creating a file path string.
</p>

<ol class="org-ol">
<li>Use the <code>io/resource</code> function on a directory that I know exists</li>
<li>Get the path string from the <code>java.net.URL</code> class, which is what the <code>io/resource</code> returns</li>
<li>Append the filename at the end of the path string</li>
</ol>

<p>
Which ended up with the following code.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(require '[clojure.java.io :as io])

(let [folder-url (io/resource "a-directory")
      folder-path (.getPath folder-url)
      file-path (str folder-path "/a-file.txt")]
  (spit file-path "hello world!"))
</pre>
</div>

<p>
Now that I explained this in words, I have no idea why I got stuck in the first place. I had a straightforward error and a straightforward solution. I feel a little stupid, but I wrote this blog post so its going on my blog.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
